Revit 2026 API

# EditScopeCancel Method

---

Cancels the edit scope.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Cancel()
```
```vb
Public Sub Cancel
```
```cpp
public:
void Cancel()
```
```fsharp
member Cancel : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | EditScope is not active. EditScope can only be committed or cancelled when it is active. -or- EditScope cannot be closed, for there is a transaction or transaction group still open in the document. |

All the changes made after starting the EditScope will be rolled back.

#### Reference

EditScope Class

Autodesk.Revit.DB Namespace